## Merging data

In [2]:
import pandas as pd

In [6]:
data1 = {
    'id':[1,2,3],
    'name':['Ahmad','Manha','Ali'],
    'age':[28,31,25]
}
df1 = pd.DataFrame(data1)
df1

   id   name  age
0   1  Ahmad   28
1   2  Manha   31
2   3    Ali   25

In [9]:
data2 = {
    'id': [1,2,3],
    'city': ['karachi','lahore','Islamabad'],
    'occupation':['engineer', 'doctor','teacher']
}
df2 = pd.DataFrame(data2)
df2

   id       city occupation
0   1    karachi   engineer
1   2     lahore     doctor
2   3  Islamabad    teacher

In [10]:
merged_df = pd.merge(df1,df2, on='id', how= 'inner')
merged_df

   id   name  age       city occupation
0   1  Ahmad   28    karachi   engineer
1   2  Manha   31     lahore     doctor
2   3    Ali   25  Islamabad    teacher